{"title:": "Women Blouse, Ninasill Hooded Sweatshirt Coat Winter Warm Wool Zipper Pockets Cotton Coat Outwear", "description": ["(=^ ^=) 1.It is made of high quality materials,durable enought for your daily wearing<br>(=^ ^=) 2.Stylish and fashion design make you more attractive<br>(=^ ^=) 3.Perfect Match with your favorite shorts,leggings, black slacks, denim jeans, etc<br>(=^ ^=) 4.Great for Daily,Casual,I am sure you will like it! <br><br>(=^ ^=) If you would like to know more products of our store, please pay close attention to <b>Ninasill</b> <br><br>Loose Blouse V-Neck Blouse Solid Color Blouse Sling Blouse Fashion Blouse Cool Blouse Vintage Blouse Popular Blouse Fun Blouse Sexy Blouse Lace Vest Blouse Wild <br>Blouse Sleeveless Blouse Lace Blouse Lace Stitching Blouse Sweaters T-Shirts Men Blouse Women Blouse Girls Blouse Boys Blouse Kid Blouse Adult Blouse Children Blouse Printing Vest Rose Blouse Velvet Shirt Couple Blouse Elegant Blouse Long <br>Sleeve Blouse Lace Vest Printed Blouse High Low Hem Blouse Top Short Sleeve Blouses Hollow Clothing V-Collar Vest Casual Shirts Out Shoulder Blouse Three Quarter Sleeve Shirts Chiffon Blouse Floral Printed Button Shirts"]}
{"title:": "Y-BIN Women's Capri Tights leggings Yoga Pants Calf-Length with Side pockets", "description": ["Y-BIN Women's Leggings Fitted Capris Gym Workout Running Tights Pants A light yoga stretch at home? The fabric is our awesome peach performance fabric. Super soft and a great mid-weight legging."]}
{"title:": "Crazy Women's Sexy Leather Backless Bodycon Clubwear Mini Dress Nightclub", "description": ["Material : Core-spun fabric silk <br> feature: embroider,Free size. <br> function: Breathe freely, body thin leg, hip, open files, prevent to take off the wire. <br> Suitable season :spring, summer, autumn, winter. <br> High transparency and flexibility. <br> This sexy lingerie will make you unique and sexy. Unique style design,Show your perfect body and pretty. How attractive! Wearing it,showing your charm,to be a sexy woman, giving him a surprise and making your life more exotic<br>"]}
{"title:": "Alion Women Classic Sexy Plunge V-Neck Low Back Skinny Fit Evening Dress Low Back Camis Dresses", "description": ["<br>Marterial: <br><br>we recommend you to double check size measurement in each product description comparing with your clothes.If you haven't tried our goods before, we suggest you to pick 1~2 size bigger items.:)<br><br>Package:Other accessories not include<br><br>Material:Polyester<br>Size details:<br>US XX-Small=China Small:Length:69.29\"(176cm),Bust:33.86\"(86cm),Waist:29.13\"(74cm),Hip:37.40\"(95cm);<br>US X-Small=China Medium:Length:69.68\"(177cm),Bust:35.43\"(90cm),Waist:30.71\"(78cm),Hip:38.98\"(99cm);<br>US Small=China Large:Length:70.08\"(178cm),Bust:37.01\"(94cm),Waist:32.28\"(82cm),Hip:40.55\"(103cm);<br>US Medium=China X-Large:Length:70.47\"(179cm),Bust:38.58\"(98cm),Waist:33.86\"(86cm),Hip:42.13\"(107cm);<br>"]}
{"title:": "Men's The Thing Mens Outpost #31 Research Team T Shirt Heather Gray", "description": ["Mens Outpost #31 Research Team T Shirt Heather Gray"]}
{"title:": "Honchosfx Mens Retro Creedence Clearwater Revival 1971 T-Shirt Brown", "description": ["Although they found their success in the late 60s and early 70s, Creedence Clearwater Revival remain an important part of the American music culture of today. The band has countless fans the world-over, with many followers captivated by their Southern rock style.<br /><br /> The shirt showcases Creedence Clearwater Revivals Cincinnati Gardens concert from 1971 and is a must-buy for anyone with an eclectic taste in music. The crew neck tee is made from 100% cotton and showcases a bold design across a brown backdrop.<br /><br /> Printed on a soft lightweight cotton tee that has a regular fashionable fit.<br /><br /> For more music-themed products please check out our full range of items."]}
{"title:": "Mens Retro Rescue Team Not Assassins T Shirt Military Green Medium - Chest 34-36in Military Green", "description": []}
{"title:": "Suncolor8 Women Sleeveless Crop Top &amp; Biker Shorts Sexy Contrast 2-Piece Outfit", "description": ["If you are interested in our products, please enter our shop for a full look. Please feel free to inquire us anytime. Thank you for your business! Please Note: Our size is Asian Size, Please choose one size up when you place the order, Thanks.<br>Package:Other accessories not include<br> <br>Material:Cotton blend<br>Size details:<br> US XX-Small=China S:Length:15.75\"(40cm)+22.05\"(56cm),Bust:31.50\"(80cm),Waist:23.62\"(60cm),Hip:33.46\"(85cm);<br> US X-Small=China M:Length:16.14\"(41cm)+22.44\"(57cm),Bust:33.46\"(85cm),Waist:25.59\"(65cm),Hip:35.43\"(90cm);<br> US Small=China L:Length:16.54\"(42cm)+22.83\"(58cm),Bust:35.43\"(90cm),Waist:27.56\"(70cm),Hip:37.40\"(95cm);<br> US Medium=China XL:Length:16.93\"(43cm)+23.23\"(59cm),Bust:37.40\"(95cm),Waist:29.53\"(75cm),Hip:39.37\"(100cm);<br> US Large=China 2XL:Length:17.32\"(44cm)+23.62\"(60cm),Bust:39.37\"(100cm),Waist:31.50\"(80cm),Hip:41.34\"(105cm);<br>"]}
{"title:": "CHXU Women's Vampire Tooth Long Sleeve T-Shirt", "description": ["Impress your friends with this unique funny shirt, sure to standout.This unique T-Shirt is designed and printed with eco-friendly ink-so it is safe for you and the environment.This durable, comfortable T-Shirt is sure to be a hit, whether you're buying it as a gift for somebody special or wearing it yourself.You'll love this cute and comfortable classic fit, 100% cotton tee! They're perfect for the weekends, vacations, and gifts. Shirt is in Adult Sizes"]}
{"title:": "Jesus 14 Kt Gold Overlay Pendant Pin", "description": ["gold overlay  jewelry is made from solid gold and filled with other metals.\n\nWith gold at an all time high in cost, gold-filled jewelry is a great way to look like you spent hundreds while keeping the cost low"]}
{"title:": "Indio Indian Id Unisex Id Bracelet 18kt Gold Overlay Enchapado", "description": []}
{"title:": "LJYH Children's Collar Motorcycle Leather Coat Boys Faux Leather Jacket", "description": []}
{"title:": "Crucified Jesus Cross Religious Medal Engravable Blessed by His Holiness", "description": ["This religious item was blessed at the Vatican in Rome, Italy... Included is little card with the blessing,a beautiful organza bag to keep your religious keepsake. We go to Italy twice a year to bless all our religious items. We also have some items that have not been blessed but equally beautiful."]}
{"title:": "Emaan's Men's Rider Slim Fit Stylish Leather Jacket", "description": []}
{"title:": "Emaan Men's Assasian Creed Cotton Jacket", "description": []}
{"title:": "Alion Women's Sexy Long Sleeve Velvet Slim Button Suit Blazers", "description": ["<br>Marterial: <br><br>we recommend you to double check size measurement in each product description comparing with your clothes.If you haven't tried our goods before, we suggest you to pick 1~2 size bigger items.:)<br><br>Package:Other accessories not include<br><br>Material:Polyester<br>Size details:<br>US X-Small=China Medium:Length:24.41\"(62cm),Bust:35.43\"(90cm),Sleeve Length:22.83\"(58cm);<br>US Small=China Large:Length:25.59\"(65cm),Bust:37.01\"(94cm),Sleeve Length:23.23\"(59cm);<br>US Medium=China X-Large:Length:26.77\"(68cm),Bust:38.58\"(98cm),Sleeve Length:23.62\"(60cm);<br>US Large=China 2X-Large:Length:27.95\"(71cm),Bust:40.16\"(102cm),Sleeve Length:24.02\"(61cm);<br>"]}
{"title:": "Oberora-Men Plus Size Cotton Stretchy Thermal Long John Pants Bottoms", "description": ["<br>if products is defective or damage upon arrival, or wrong product shipped, pls contact us immediately, we will do give you satisfactory solution.Thank you for your purchase.<br><br>Package:Other accessories not include<br><br>Material:Cotton<br>Size details:<br>US Small=China XL:Length:39.37\"(100cm),Waist:29.13\"(74cm)-39.37\"(100cm);<br>US Medium=China 2XL:Length:40.16\"(102cm),Waist:30.71\"(78cm)-43.31\"(110cm);<br>US Large=China 3XL:Length:40.94\"(104cm),Waist:32.28\"(82cm)-47.24\"(120cm);<br>US X-Large=China4XL:Length:41.73\"(106cm),Waist:29.92\"(76cm)-43.31\"(110cm);<br>US 2X-Large=China 5XL:Length:42.52\"(108cm),Waist:31.50\"(80cm)-47.24\"(120cm);<br>US 3X-Large=China 6XL:Length:43.31\"(110cm),Waist:32.68\"(83cm)-51.18\"(130cm);<br>"]}
{"title:": "FLCH+YIGE Womens Lapel Long Sleeve Faux Fur Collar Wool Blend Long Pea Jacket", "description": ["Please Note Purchasing Notes:<br> 1.Please check the size information under the Product Description before ordering,rather than the \"size chart\" beside the drop down box.<br> 2.Please note that due to limitations in photography and the inevitable differences in monitor settings,the colors shown in the photograph may not correspond 100% to those in the items themselves.<br> 3.Customer ServiceIf:you have any problem on the product,please feel free to contact us,we will give best service and solution,wish you have a nice shopping experience.<br><br>Package:Other accessories not include<br> <br>Material:Polyester<br>Size details:<br> US X-Small=China Medium:Length:42.13\"(107cm),Bust:36.22\"(92cm),Shoulder:14.57\"(37cm);<br> US Small=China Large:Length:42.52\"(108cm),Bust:37.80\"(96cm),Shoulder:14.96\"(38cm);<br> US Medium=China X-Large:Length:42.91\"(109cm),Bust:39.37\"(100cm),Shoulder:15.35\"(39cm);<br> US Large=China 2X-Large:Length:43.31\"(110cm),Bust:40.94\"(104cm),Shoulder:15.75\"(40cm);<br> US X-Large=China 3X-Large:Length:43.70\"(111cm),Bust:42.52\"(108cm),Shoulder:16.14\"(41cm);<br> US 2X-Large=China 4X-Large:Length:44.09\"(112cm),Bust:44.09\"(112cm),Shoulder:16.54\"(42cm);<br>"]}
{"title:": "ZYFGfree Womens Hip Hop Oblique Zipper Faux-Leather Sleeveless Motorcycle Vest", "description": ["To ensure your best fit, please have a careful check of size info before order; Should any doubts, please contact ZYFGfree company customer service team directly for suggestions only, along with your detailed size info;<br>Package:Other accessories not include<br> <br>Material:Polyester<br>Size details:<br> US XS=China S:Length:19.29\"(49cm),Bust:32.28\"(82cm);<br> US S=China M:Length:19.69\"(50cm),Bust:33.86\"(86cm);<br> US M=China L:Length:20.08\"(51cm),Bust:35.43\"(90cm);<br> US L=China XL:Length:20.47\"(52cm),Bust:37.01\"(94cm);<br>"]}
{"title:": "Our Lady of Good Counsel Brown Corded Necklace with Pendant Blessed By His Holiness Pope Francis", "description": ["Our Lady of Good Counsel Brown Corded Necklace with Pendant Blessed By His Holiness Pope Francis Patron of Unwed Expecting Women 2\" color medal pendant Our Lady of Good Counsel antique gold finish 24 inch brown corded necklace - Made in Brazil Includes a card with the date that your item was blessed by His Holiness Francis"]}